grevaillot/svd_tools/headers/ATSAMR35J17B/port_iobus.h
/** @defgroup port_iobus_pmux0_2 PMUX02 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_2_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_2_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_2_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_2_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_2_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_2_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_3 PMUX03 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_3_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_3_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_3_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_3_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_3_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_3_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_4 PMUX04 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_4_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_4_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_4_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_4_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_4_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_4_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_5 PMUX05 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_5_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_5_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_5_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_5_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_5_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_5_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_6 PMUX06 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_6_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_6_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_6_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_6_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_6_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_6_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_7 PMUX07 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_7_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_7_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_7_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_7_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_7_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_7_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_8 PMUX08 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_8_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_8_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_8_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_8_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_8_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_8_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_9 PMUX09 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_9_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_9_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_9_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_9_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_9_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_9_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_10 PMUX010 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_10_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_10_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_10_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_10_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_10_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_10_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_11 PMUX011 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_11_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_11_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_11_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_11_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_11_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_11_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_12 PMUX012 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_12_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_12_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_12_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_12_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_12_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_12_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_13 PMUX013 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_13_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_13_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_13_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_13_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_13_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_13_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_14 PMUX014 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_14_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_14_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_14_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_14_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_14_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_14_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux0_15 PMUX015 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_IOBUS_PMUX0_15_PMUXO_SHIFT		4
#define PORT_IOBUS_PMUX0_15_PMUXO_MASK		0x0f
/** @defgroup port_iobus_pmux0_15_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_IOBUS_PMUX0_15_PMUXE_SHIFT		0
#define PORT_IOBUS_PMUX0_15_PMUXE_MASK		0x0f
/** @defgroup port_iobus_pmux0_15_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pincfg0_0 PINCFG00 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_0_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_0_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_0_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_0_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_0_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_0_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_0_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_0_PMUXEN		(1 << 0)

/**@}*/

