grevaillot/svd_tools/headers/ATSAMR35J17B/port_iobus.h
/** @defgroup port_iobus_pincfg0_1 PINCFG01 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_1_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_1_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_1_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_1_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_1_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_1_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_1_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_1_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_2 PINCFG02 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_2_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_2_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_2_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_2_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_2_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_2_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_2_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_2_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_3 PINCFG03 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_3_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_3_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_3_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_3_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_3_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_3_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_3_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_3_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_4 PINCFG04 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_4_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_4_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_4_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_4_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_4_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_4_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_4_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_4_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_5 PINCFG05 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_5_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_5_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_5_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_5_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_5_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_5_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_5_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_5_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_6 PINCFG06 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_6_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_6_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_6_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_6_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_6_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_6_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_6_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_6_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_7 PINCFG07 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_7_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_7_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_7_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_7_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_7_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_7_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_7_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_7_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_8 PINCFG08 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_8_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_8_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_8_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_8_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_8_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_8_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_8_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_8_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_9 PINCFG09 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_9_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_9_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_9_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_9_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_9_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_9_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_9_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_9_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_10 PINCFG010 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_10_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_10_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_10_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_10_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_10_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_10_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_10_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_10_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_11 PINCFG011 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_11_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_11_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_11_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_11_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_11_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_11_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_11_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_11_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_12 PINCFG012 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_12_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_12_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_12_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_12_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_12_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_12_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_12_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_12_PMUXEN		(1 << 0)

/**@}*/

