grevaillot/svd_tools/headers/ATSAMR35J17B/port_iobus.h
/** @defgroup port_iobus_pincfg0_13 PINCFG013 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_13_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_13_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_13_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_13_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_13_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_13_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_13_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_13_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_14 PINCFG014 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_14_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_14_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_14_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_14_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_14_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_14_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_14_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_14_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_15 PINCFG015 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_15_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_15_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_15_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_15_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_15_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_15_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_15_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_15_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_16 PINCFG016 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_16_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_16_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_16_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_16_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_16_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_16_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_16_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_16_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_17 PINCFG017 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_17_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_17_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_17_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_17_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_17_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_17_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_17_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_17_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_18 PINCFG018 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_18_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_18_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_18_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_18_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_18_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_18_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_18_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_18_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_19 PINCFG019 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_19_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_19_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_19_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_19_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_19_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_19_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_19_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_19_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_20 PINCFG020 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_20_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_20_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_20_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_20_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_20_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_20_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_20_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_20_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_21 PINCFG021 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_21_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_21_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_21_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_21_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_21_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_21_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_21_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_21_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_22 PINCFG022 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_22_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_22_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_22_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_22_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_22_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_22_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_22_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_22_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_23 PINCFG023 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_23_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_23_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_23_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_23_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_23_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_23_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_23_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_23_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_24 PINCFG024 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_24_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_24_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_24_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_24_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_24_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_24_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_24_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_24_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_25 PINCFG025 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_25_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_25_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_25_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_25_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_25_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_25_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_25_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_25_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_26 PINCFG026 Pin Configuration n - Group 0
@{*/

