grevaillot/svd_tools/headers/ATSAMR35J17B/port_iobus.h
/** PORT_IOBUS_PINCFG0_26_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_26_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_26_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_26_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_26_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_26_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_26_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_26_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_27 PINCFG027 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_27_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_27_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_27_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_27_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_27_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_27_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_27_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_27_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_28 PINCFG028 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_28_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_28_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_28_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_28_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_28_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_28_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_28_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_28_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_29 PINCFG029 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_29_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_29_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_29_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_29_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_29_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_29_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_29_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_29_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_30 PINCFG030 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_30_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_30_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_30_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_30_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_30_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_30_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_30_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_30_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_pincfg0_31 PINCFG031 Pin Configuration n - Group 0
@{*/

/** PORT_IOBUS_PINCFG0_31_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_PINCFG0_31_DRVSTR		(1 << 6)
/** PORT_IOBUS_PINCFG0_31_PULLEN Pull Enable **/
#define PORT_IOBUS_PINCFG0_31_PULLEN		(1 << 2)
/** PORT_IOBUS_PINCFG0_31_INEN Input Enable **/
#define PORT_IOBUS_PINCFG0_31_INEN		(1 << 1)
/** PORT_IOBUS_PINCFG0_31_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_PINCFG0_31_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_iobus_dir1 DIR1 Data Direction
@{*/


#define PORT_IOBUS_DIR1_DIR_SHIFT		0
#define PORT_IOBUS_DIR1_DIR_MASK		0xffffffff
/** @defgroup port_iobus_dir1_dir DIR Port Data Direction
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_dirclr1 DIRCLR1 Data Direction Clear
@{*/


#define PORT_IOBUS_DIRCLR1_DIRCLR_SHIFT		0
#define PORT_IOBUS_DIRCLR1_DIRCLR_MASK		0xffffffff
/** @defgroup port_iobus_dirclr1_dirclr DIRCLR Port Data Direction Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_dirset1 DIRSET1 Data Direction Set
@{*/


#define PORT_IOBUS_DIRSET1_DIRSET_SHIFT		0
#define PORT_IOBUS_DIRSET1_DIRSET_MASK		0xffffffff
/** @defgroup port_iobus_dirset1_dirset DIRSET Port Data Direction Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_dirtgl1 DIRTGL1 Data Direction Toggle
@{*/


#define PORT_IOBUS_DIRTGL1_DIRTGL_SHIFT		0
#define PORT_IOBUS_DIRTGL1_DIRTGL_MASK		0xffffffff
/** @defgroup port_iobus_dirtgl1_dirtgl DIRTGL Port Data Direction Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_out1 OUT1 Data Output Value
@{*/


#define PORT_IOBUS_OUT1_OUT_SHIFT		0
#define PORT_IOBUS_OUT1_OUT_MASK		0xffffffff
/** @defgroup port_iobus_out1_out OUT Port Data Output Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_outclr1 OUTCLR1 Data Output Value Clear
@{*/


#define PORT_IOBUS_OUTCLR1_OUTCLR_SHIFT		0
#define PORT_IOBUS_OUTCLR1_OUTCLR_MASK		0xffffffff
/** @defgroup port_iobus_outclr1_outclr OUTCLR Port Data Output Value Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_outset1 OUTSET1 Data Output Value Set
@{*/


#define PORT_IOBUS_OUTSET1_OUTSET_SHIFT		0
#define PORT_IOBUS_OUTSET1_OUTSET_MASK		0xffffffff
/** @defgroup port_iobus_outset1_outset OUTSET Port Data Output Value Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_outtgl1 OUTTGL1 Data Output Value Toggle
@{*/


#define PORT_IOBUS_OUTTGL1_OUTTGL_SHIFT		0
#define PORT_IOBUS_OUTTGL1_OUTTGL_MASK		0xffffffff
/** @defgroup port_iobus_outtgl1_outtgl OUTTGL Port Data Output Value Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_in1 IN1 Data Input Value
@{*/


#define PORT_IOBUS_IN1_IN_SHIFT		0
#define PORT_IOBUS_IN1_IN_MASK		0xffffffff
/** @defgroup port_iobus_in1_in IN Port Data Input Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_ctrl1 CTRL1 Control
@{*/


#define PORT_IOBUS_CTRL1_SAMPLING_SHIFT		0
#define PORT_IOBUS_CTRL1_SAMPLING_MASK		0xffffffff
/** @defgroup port_iobus_ctrl1_sampling SAMPLING Input Sampling Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_wrconfig1 WRCONFIG1 Write Configuration
@{*/

/** PORT_IOBUS_WRCONFIG1_HWSEL Half-Word Select **/
#define PORT_IOBUS_WRCONFIG1_HWSEL		(1 << 31)
/** PORT_IOBUS_WRCONFIG1_WRPINCFG Write PINCFG Registers **/
#define PORT_IOBUS_WRCONFIG1_WRPINCFG		(1 << 30)
/** PORT_IOBUS_WRCONFIG1_WRPMUX Write PMUX Registers **/
#define PORT_IOBUS_WRCONFIG1_WRPMUX		(1 << 28)

#define PORT_IOBUS_WRCONFIG1_PMUX_SHIFT		24
#define PORT_IOBUS_WRCONFIG1_PMUX_MASK		0x0f
/** @defgroup port_iobus_wrconfig1_pmux PMUX Peripheral Multiplexing Template
@{*/
/**@}*/

/** PORT_IOBUS_WRCONFIG1_DRVSTR Output Driver Strength Selection **/
#define PORT_IOBUS_WRCONFIG1_DRVSTR		(1 << 22)
/** PORT_IOBUS_WRCONFIG1_PULLEN Pull Enable **/
#define PORT_IOBUS_WRCONFIG1_PULLEN		(1 << 18)
/** PORT_IOBUS_WRCONFIG1_INEN Input Enable **/
#define PORT_IOBUS_WRCONFIG1_INEN		(1 << 17)
/** PORT_IOBUS_WRCONFIG1_PMUXEN Select Peripheral Multiplexer **/
#define PORT_IOBUS_WRCONFIG1_PMUXEN		(1 << 16)

#define PORT_IOBUS_WRCONFIG1_PINMASK_SHIFT		0
#define PORT_IOBUS_WRCONFIG1_PINMASK_MASK		0xffff
/** @defgroup port_iobus_wrconfig1_pinmask PINMASK Pin Mask for Multiple Pin Configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_evctrl1 EVCTRL1 Event Input Control
@{*/

