grevaillot/svd_tools/headers/ATSAMR35J17B/port_iobus.h
/** PORT_IOBUS_EVCTRL1_PORTEI3 Port Event Enable Input 3 **/
#define PORT_IOBUS_EVCTRL1_PORTEI3		(1 << 31)

#define PORT_IOBUS_EVCTRL1_EVACT3_SHIFT		29
#define PORT_IOBUS_EVCTRL1_EVACT3_MASK		0x03
/** @defgroup port_iobus_evctrl1_evact3 EVACT3 Port Event Action 3
@{*/
/**@}*/


#define PORT_IOBUS_EVCTRL1_PID3_SHIFT		24
#define PORT_IOBUS_EVCTRL1_PID3_MASK		0x1f
/** @defgroup port_iobus_evctrl1_pid3 PID3 Port Event Pin Identifier 3
@{*/
/**@}*/

/** PORT_IOBUS_EVCTRL1_PORTEI2 Port Event Enable Input 2 **/
#define PORT_IOBUS_EVCTRL1_PORTEI2		(1 << 23)

#define PORT_IOBUS_EVCTRL1_EVACT2_SHIFT		21
#define PORT_IOBUS_EVCTRL1_EVACT2_MASK		0x03
/** @defgroup port_iobus_evctrl1_evact2 EVACT2 Port Event Action 2
@{*/
/**@}*/


#define PORT_IOBUS_EVCTRL1_PID2_SHIFT		16
#define PORT_IOBUS_EVCTRL1_PID2_MASK		0x1f
/** @defgroup port_iobus_evctrl1_pid2 PID2 Port Event Pin Identifier 2
@{*/
/**@}*/

/** PORT_IOBUS_EVCTRL1_PORTEI1 Port Event Enable Input 1 **/
#define PORT_IOBUS_EVCTRL1_PORTEI1		(1 << 15)

#define PORT_IOBUS_EVCTRL1_EVACT1_SHIFT		13
#define PORT_IOBUS_EVCTRL1_EVACT1_MASK		0x03
/** @defgroup port_iobus_evctrl1_evact1 EVACT1 Port Event Action 1
@{*/
/**@}*/


#define PORT_IOBUS_EVCTRL1_PID1_SHIFT		8
#define PORT_IOBUS_EVCTRL1_PID1_MASK		0x1f
/** @defgroup port_iobus_evctrl1_pid1 PID1 Port Event Pin Identifier 1
@{*/
/**@}*/

/** PORT_IOBUS_EVCTRL1_PORTEI0 Port Event Enable Input 0 **/
#define PORT_IOBUS_EVCTRL1_PORTEI0		(1 << 7)

#define PORT_IOBUS_EVCTRL1_EVACT0_SHIFT		5
#define PORT_IOBUS_EVCTRL1_EVACT0_MASK		0x03
/** @defgroup port_iobus_evctrl1_evact0 EVACT0 Port Event Action 0
@{*/
/**@}*/


#define PORT_IOBUS_EVCTRL1_PID0_SHIFT		0
#define PORT_IOBUS_EVCTRL1_PID0_MASK		0x1f
/** @defgroup port_iobus_evctrl1_pid0 PID0 Port Event Pin Identifier 0
@{*/
/**@}*/


/**@}*/

/** @defgroup port_iobus_pmux1_0 PMUX10 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_1 PMUX11 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_2 PMUX12 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_3 PMUX13 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_4 PMUX14 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_5 PMUX15 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_6 PMUX16 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_7 PMUX17 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_8 PMUX18 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_9 PMUX19 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_10 PMUX110 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_11 PMUX111 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_12 PMUX112 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_13 PMUX113 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_14 PMUX114 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pmux1_15 PMUX115 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_0 PINCFG10 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_1 PINCFG11 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_2 PINCFG12 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_3 PINCFG13 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_4 PINCFG14 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_5 PINCFG15 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_6 PINCFG16 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_7 PINCFG17 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_8 PINCFG18 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_9 PINCFG19 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_10 PINCFG110 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_11 PINCFG111 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_12 PINCFG112 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_13 PINCFG113 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_14 PINCFG114 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_15 PINCFG115 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_16 PINCFG116 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_17 PINCFG117 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_18 PINCFG118 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_19 PINCFG119 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_20 PINCFG120 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_21 PINCFG121 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_22 PINCFG122 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_23 PINCFG123 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_24 PINCFG124 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_25 PINCFG125 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_26 PINCFG126 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_27 PINCFG127 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_28 PINCFG128 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_29 PINCFG129 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_30 PINCFG130 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg1_31 PINCFG131 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_iobus_dir2 DIR2 Data Direction
@{*/


