grevaillot/svd_tools/headers/ATSAMR35J17B/port_iobus.h
/** @defgroup port_iobus_pmux2_6 PMUX26 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_7 PMUX27 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_8 PMUX28 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_9 PMUX29 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_10 PMUX210 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_11 PMUX211 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_12 PMUX212 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_13 PMUX213 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_14 PMUX214 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pmux2_15 PMUX215 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_0 PINCFG20 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_1 PINCFG21 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_2 PINCFG22 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_3 PINCFG23 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_4 PINCFG24 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_5 PINCFG25 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_6 PINCFG26 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_7 PINCFG27 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_8 PINCFG28 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_9 PINCFG29 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_10 PINCFG210 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_11 PINCFG211 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_12 PINCFG212 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_13 PINCFG213 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_14 PINCFG214 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_15 PINCFG215 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_16 PINCFG216 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_17 PINCFG217 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_18 PINCFG218 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_19 PINCFG219 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_20 PINCFG220 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_21 PINCFG221 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_22 PINCFG222 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_23 PINCFG223 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_24 PINCFG224 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_25 PINCFG225 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_26 PINCFG226 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_27 PINCFG227 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_28 PINCFG228 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_29 PINCFG229 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_30 PINCFG230 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_iobus_pincfg2_31 PINCFG231 Pin Configuration n - Group 2
@{*/


/**@}*/
